{
  "topics": [
    {
      "id": 1,
      "name": "সংখ্যা পদ্ধতি",
      "definition": "সংখ্যা পদ্ধতি হলো মান বা পরিমাণ প্রকাশ ও গণনার জন্য ব্যবহৃত একটি সুসংবদ্ধ প্রক্রিয়া বা ব্যবস্থা, যেখানে প্রতীক বা অঙ্ক (Digits) এবং সেগুলোর মান (Value) ব্যবহার করে কোনো সংখ্যাকে উপস্থাপন করা হয়। সংখ্যা পদ্ধতিকে প্রধানত দুই ভাগে ভাগ করা যায়: পজিশনাল (Positional) এবং নন-পজিশনাল (Non-Positional)। একটি পজিশনাল সংখ্যা পদ্ধতিতে সংখ্যার নিজস্ব মানের পাশাপাশি তার অবস্থানের (Position) গুরুত্ব থাকে, যা আধুনিক কম্পিউটারে ডেটা প্রক্রিয়াকরণের ভিত্তি।"
    },
    {
      "id": 2,
      "name": "পজিশনাল সংখ্যা ও নন পজিশনাল সংখ্যা কি? উদাহারন দাও",
      "definition": "পজিশনাল সংখ্যা পদ্ধতি হলো সেই পদ্ধতি যেখানে কোনো অঙ্কের মান তার অবস্থানের (Position) ওপর নির্ভরশীল। সংখ্যার অবস্থান পরিবর্তন হলে তার স্থানীয় মানও পরিবর্তিত হয়। উদাহরণ: ডেসিমাল সংখ্যা পদ্ধতি (যেমন: ৭৪৪-এ প্রথম '৪'-এর মান ৪০, কিন্তু দ্বিতীয় '৪'-এর মান ৪)। নন-পজিশনাল সংখ্যা পদ্ধতি হলো সেই পদ্ধতি যেখানে কোনো অঙ্কের মান তার অবস্থানের ওপর নির্ভরশীল নয়, অর্থাৎ সংখ্যাটির নিজস্ব মান সব ক্ষেত্রেই একই থাকে। উদাহরণ: প্রাচীন রোমান সংখ্যা পদ্ধতি (যেমন: 'V'-এর মান সব সময়ই ৫), যা আধুনিক গণনার জন্য অনুপযোগী।"
    },
    {
      "id": 3,
      "name": "সংখ্যা পদ্ধতির বেজ",
      "definition": "কোনো একটি পজিশনাল সংখ্যা পদ্ধতিতে ব্যবহৃত মোট স্বতন্ত্র প্রতীক বা অঙ্কের সংখ্যাকে ওই সংখ্যা পদ্ধতির বেজ বা ভিত্তি (Radix) বলা হয়। বেজ থেকেই সংখ্যা পদ্ধতির নাম ও তার স্থানীয় মান গণনা নির্ধারিত হয়। যেমন: ডেসিমাল (দশমিক) সংখ্যা পদ্ধতিতে ০ থেকে ৯ পর্যন্ত মোট ১০টি অঙ্ক ব্যবহৃত হয়, তাই এর বেজ হলো ১০। বাইনারি সংখ্যা পদ্ধতিতে ০ ও ১ এই দুটি অঙ্ক ব্যবহৃত হয়, তাই এর বেজ হলো ২।"
    },
    {
      "id": 4,
      "name": "সংখ্যা পদ্ধতির প্রকারভেদ",
      "definition": "সংখ্যা পদ্ধতিকে মৌলিকভাবে দুই প্রকারে ভাগ করা যায়: পজিশনাল সংখ্যা পদ্ধতি (Positional Number System) এবং নন-পজিশনাল সংখ্যা পদ্ধতি (Non-Positional Number System)। পজিশনাল পদ্ধতির আবার চারটি প্রধান প্রকারভেদ রয়েছে যা কম্পিউটারে বহুল ব্যবহৃত: ১. ডেসিমাল (Decimal) বা দশমিক (বেজ ১০), ২. বাইনারি (Binary) বা দ্বি-আধার (বেজ ২), ৩. অক্টাল (Octal) বা অষ্টক (বেজ ৮), এবং ৪. হেক্সাডেসিমাল (Hexadecimal) বা ষোড়শ (বেজ ১৬)।"
    },
    {
      "id": 5,
      "name": "বাইনারি সংখ্যা",
      "definition": "বাইনারি সংখ্যা পদ্ধতি হলো পজিশনাল সংখ্যা পদ্ধতির একটি রূপ, যার বেজ বা ভিত্তি হলো ২। এই পদ্ধতিতে শুধুমাত্র দুটি অঙ্ক— ০ (জিরো) এবং ১ (ওয়ান)—ব্যবহৃত হয়। এটিই হলো কম্পিউটারের নিজস্ব ভাষা, কারণ ইলেকট্রনিক সার্কিটে বিদ্যুৎ প্রবাহের উপস্থিতি (১) বা অনুপস্থিতি (০) দ্বারা ডেটা সংরক্ষণের জন্য এই পদ্ধতি সবচেয়ে উপযোগী। বাইনারি অঙ্ককে সংক্ষেপে বিট (Bit) বলা হয়।"
    },
    {
      "id": 6,
      "name": "অক্টাল সংখ্যা",
      "definition": "অক্টাল সংখ্যা পদ্ধতি হলো পজিশনাল সংখ্যা পদ্ধতির একটি রূপ, যার বেজ বা ভিত্তি হলো ৮। এই পদ্ধতিতে মোট আটটি অঙ্ক— ০ থেকে ৭ পর্যন্ত—ব্যবহৃত হয়। অক্টাল সংখ্যার একটি প্রধান সুবিধা হলো এটিকে সহজে বাইনারি সংখ্যায় রূপান্তর করা যায়; একটি অক্টাল অঙ্ককে মাত্র তিনটি বাইনারি বিট দ্বারা প্রকাশ করা সম্ভব। এটি অতীতে মিনি কম্পিউটারগুলোতে ইনপুট/আউটপুট ডেটা সংক্ষিপ্তভাবে উপস্থাপনের জন্য ব্যবহৃত হতো।"
    },
    {
      "id": 7,
      "name": "হেক্সাডেসিমাল সংখ্যা",
      "definition": "হেক্সাডেসিমাল সংখ্যা পদ্ধতি হলো পজিশনাল সংখ্যা পদ্ধতির একটি রূপ, যার বেজ বা ভিত্তি হলো ১৬। এই পদ্ধতিতে মোট ষোলোটি প্রতীক ব্যবহৃত হয়: ০ থেকে ৯ পর্যন্ত দশটি অঙ্ক এবং A থেকে F পর্যন্ত ছয়টি ইংরেজি বর্ণ (যেখানে A = ১০, B = ১১, ... , F = ১৫)। এই পদ্ধতির সবচেয়ে বড় সুবিধা হলো ডেটা অ্যাড্রেসিং এবং বাইনারি কোডকে সংক্ষিপ্তভাবে উপস্থাপনের জন্য এটি অত্যন্ত কার্যকর; একটি হেক্সাডেসিমাল অঙ্ককে মাত্র চারটি বাইনারি বিট দ্বারা প্রকাশ করা যায়।"
    },
    {
      "id": 8,
      "name": "ডেসিমাল সংখ্যা",
      "definition": "ডেসিমাল সংখ্যা পদ্ধতি বা দশমিক সংখ্যা পদ্ধতি হলো সেই পজিশনাল সংখ্যা পদ্ধতি যা আমরা দৈনন্দিন জীবনে গণনা ও হিসাবের জন্য ব্যবহার করি। এর বেজ বা ভিত্তি হলো ১০, এবং এতে মোট দশটি অঙ্ক— ০, ১, ২, ৩, ৪, ৫, ৬, ৭, ৮, এবং ৯—ব্যবহৃত হয়। প্রতিটি ডেসিমাল অঙ্কের মান তার নিজস্ব মানের পাশাপাশি তার অবস্থান অনুসারে ১০-এর পাওয়ার দ্বারা গুণিত হয়ে তার স্থানীয় মান নির্ধারণ করে।"
    },
    {
      "id": 9,
      "name": "চিহ্নযুক্ত সংখ্যা",
      "definition": "কম্পিউটারে ধনাত্মক (Positive) এবং ঋণাত্মক (Negative) উভয় প্রকার সংখ্যাকে উপস্থাপন করার পদ্ধতিকে চিহ্নযুক্ত সংখ্যা (Signed Number) বলা হয়। যেহেতু কম্পিউটার শুধু ০ এবং ১ বোঝে, তাই সংখ্যার চিহ্ন বোঝানোর জন্য একটি অতিরিক্ত বিট ব্যবহার করা হয়, যাকে চিহ্ন বিট (Sign Bit) বলে। সাধারণত, ০ দ্বারা ধনাত্মক এবং ১ দ্বারা ঋণাত্মক সংখ্যা বোঝানো হয়। চিহ্নযুক্ত সংখ্যা প্রকাশের জন্য তিনটি পদ্ধতি প্রচলিত: প্রকৃত মান গঠন (Sign-Magnitude), ১'s কমপ্লিমেন্ট এবং ২'s কমপ্লিমেন্ট।"
    },
    {
      "id": 10,
      "name": "২’এর পরিপূরক কি? উদাহারন",
      "definition": "২'এর পরিপূরক (Two’s Complement) হলো কম্পিউটারে ঋণাত্মক সংখ্যা উপস্থাপনের এবং বাইনারি বিয়োগ সম্পন্ন করার সবচেয়ে কার্যকর পদ্ধতি। ঋণাত্মক সংখ্যা নির্ণয়ের জন্য প্রথমে সংখ্যাটির বাইনারি মানের ১'s কমপ্লিমেন্ট (০-কে ১ এবং ১-কে ০ করা) বের করা হয়, এবং তারপর সেই মানের সাথে ১ যোগ করা হয়। উদাহরণ: ডেসিমাল -৫ কে ৮-বিটে প্রকাশ করতে প্রথমে ৫-এর বাইনারি (০ ০০০০১০১) এর ১'s কমপ্লিমেন্ট (১ ১১১১০১০) বের করা হয়, এবং এর সাথে ১ যোগ করলে ২'s কমপ্লিমেন্ট হয় (১ ১১১১০১১)। এটি বাইনারি বিয়োগকে যোগের মাধ্যমে সম্পন্ন করার সুযোগ দেয়, যা হার্ডওয়্যারের জটিলতা কমায়।"
    },
    {
      "id": 11,
      "name": "কোড",
      "definition": "কোড হলো এমন একটি নির্দিষ্ট নিয়মের সেট যা মানুষ বা অন্য কোনো মাধ্যমে ব্যবহৃত ডেটা বা তথ্যকে (যেমন— অক্ষর, প্রতীক, সংখ্যা, চিহ্ন) কম্পিউটারের বোধগম্য বাইনারি বিন্যাসে (০ ও ১) প্রকাশ করার জন্য ব্যবহৃত হয়। বিভিন্ন ধরনের কোড বিভিন্ন উদ্দেশ্যে ব্যবহৃত হয়, যেমন: সংখ্যা ও বর্ণমালাকে কম্পিউটারে উপস্থাপনের জন্য আলফানিউমেরিক কোড (ASCII, Unicode) এবং গাণিতিক কাজের জন্য বাইনারি কোড (BCD)।"
    },
    {
      "id": 12,
      "name": "বিসিডি কোড",
      "definition": "বিসিডি কোড (BCD - Binary Coded Decimal) হলো এক ধরনের পদ্ধতি, যেখানে ডেসিমাল সংখ্যার (০ থেকে ৯) প্রতিটি অঙ্ককে তার সমতুল্য চার-বিট বাইনারি কোড দ্বারা আলাদাভাবে উপস্থাপন করা হয়। এটি কোনো একটি ডেসিমাল সংখ্যাকে সম্পূর্ণ বাইনারিতে রূপান্তর করার পরিবর্তে, প্রতি ডেসিমাল অঙ্কের জন্য একটি বাইনারি গ্রুপ ব্যবহার করে। \n উদাহরণ:\n ডেসিমাল সংখ্যা ৯২-কে বিসিডি-তে প্রকাশ করা হয় (৯-এর জন্য ১০০১ এবং ২-এর জন্য ০০১০), অর্থাৎ ১০০১ ০০১০।\n  BCD কোড দশমিক হিসাব দ্রুত করার জন্য ব্যবহৃত হয়, কিন্তু এটি সাধারণ বাইনারির চেয়ে বেশি মেমরি ব্যবহার করে।"
    },
    {
      "id": 13,
      "name": "BCD code ও Binary সংখ্যা কি এক?",
      "definition": "না, BCD কোড এবং সাধারণ বাইনারি সংখ্যা পদ্ধতি এক নয়। BCD কোড হলো ডেসিমাল সংখ্যার প্রতিটি অঙ্ককে আলাদাভাবে চার-বিট বাইনারি দ্বারা উপস্থাপন করার একটি পদ্ধতি (যেমন: ডেসিমাল ১২ কে BCD তে লেখা হয় ০০০১ ০০১০)। অন্যদিকে, বাইনারি সংখ্যা হলো ডেসিমাল সংখ্যার সমগ্র মানটিকে একটি একক বাইনারি মান দ্বারা উপস্থাপন করা (যেমন: ডেসিমাল ১২ কে বাইনারিতে লেখা হয় ১১০০)। BCD কোড প্রায়শই বেশি মেমরি ব্যবহার করে, কিন্তু মানুষের জন্য দশমিক মান হিসাব করা সহজ করে তোলে।"
    },
    {
      "id": 14,
      "name": "আসকি কোড",
      "definition": "আসকি কোড (ASCII - American Standard Code for Information Interchange) হলো একটি বহুল ব্যবহৃত ৭-বিট কোড, যা ইংরেজী বর্ণমালা (ছোট ও বড় হাতের), অঙ্ক (০-৯), গাণিতিক প্রতীক এবং বিভিন্ন নিয়ন্ত্রণমূলক অক্ষরসহ মোট ১২৮টি প্রতীককে (০ থেকে ১২৭) বাইনারি আকারে উপস্থাপনের জন্য ডিজাইন করা হয়েছিল। এটি ছিল কম্পিউটার এবং যোগাযোগ ডিভাইসগুলির মধ্যে ডেটা আদান-প্রদানের জন্য একটি প্রাথমিক শিল্প মান (Standard), যা বিশ্বজুড়ে ব্যবহৃত প্রথম দিকের আলফানিউমেরিক কোডগুলোর মধ্যে অন্যতম।"
    },
    {
      "id": 15,
      "name": "ইউনিকোড",
      "definition": "ইউনিকোড (Unicode) হলো একটি আধুনিক, আন্তর্জাতিক এবং ব্যাপক ক্যারেক্টার এনকোডিং স্ট্যান্ডার্ড, যা বিশ্বের প্রায় সকল ভাষা এবং প্রতীককে একক ও অভিন্ন কোডিং পদ্ধতির মাধ্যমে উপস্থাপনের জন্য তৈরি করা হয়েছে। এটি আসকি কোডের সীমাবদ্ধতা দূর করে, যেখানে আসকি কোডে যেখানে মাত্র ১২৮টি অক্ষর কোড করা যেত, সেখানে ইউনিকোড ১৬ বিট বা ৩২ বিট ব্যবহার করে লক্ষ লক্ষ স্বতন্ত্র অক্ষরকে (যেমন: বাংলা, চীনা, জাপানি এবং ইমোজি) কোড করার ক্ষমতা রাখে। বর্তমান ইন্টারনেটে এবং অপারেটিং সিস্টেমে এটিই প্রধান কোডিং মান হিসাবে ব্যবহৃত হয়।"
    },
    {
      "id": 16,
      "name": "রেডিক্স পয়েন্ট",
      "definition": "রেডিক্স পয়েন্ট (Radix Point) হলো পজিশনাল সংখ্যা পদ্ধতিতে ব্যবহৃত একটি বিশেষ প্রতীক বা চিহ্ন, যা একটি সংখ্যার পূর্ণাংশ (Integer Part) এবং ভগ্নাংশ (Fractional Part) কে পৃথক করে। দশমিক সংখ্যা পদ্ধতিতে রেডিক্স পয়েন্টকে দশমিক বিন্দু (Decimal Point) বলা হয়। বাইনারি সংখ্যা পদ্ধতিতে একে বাইনারি পয়েন্ট, অক্টাল সংখ্যা পদ্ধতিতে অক্টাল পয়েন্ট এবং হেক্সাডেসিমাল সংখ্যা পদ্ধতিতে হেক্সাডেসিমাল পয়েন্ট বলা হয়। এই পয়েন্টের বাম পাশের অঙ্কগুলোর স্থানীয় মান বেজের ধনাত্মক ঘাত এবং ডান পাশের অঙ্কগুলোর স্থানীয় মান বেজের ঋণাত্মক ঘাত হিসেবে গণ্য হয়।"
    }
  ]
}
