{
  "topics": [
    {
      "id": 1,
      "name": "ব্যান্ডউইথ",
      "definition": "ব্যান্ডউইথ (Bandwidth) হলো একটি নির্দিষ্ট সময়ে (সাধারণত প্রতি সেকেন্ডে) একটি ডেটা চ্যানেল বা মাধ্যম দিয়ে **সর্বোচ্চ যে পরিমাণ ডেটা স্থানান্তরিত হতে পারে** তার পরিমাপ। এটি ডেটা স্থানান্তরের হার (Data Transfer Rate) নির্দেশ করে এবং সাধারণত **বিট প্রতি সেকেন্ড (bps)** বা এর বৃহত্তর একক (যেমন: Kbps, Mbps, Gbps) দ্বারা প্রকাশ করা হয়। বৃহত্তর ব্যান্ডউইথ বলতে দ্রুত ডেটা স্থানান্তরের সক্ষমতাকে বোঝায় এবং এর মান ডেটা ট্রান্সমিশন মিডিয়ার প্রকৃতির ওপর নির্ভর করে।"
    },
    {
      "id": 2,
      "name": "ন্যারো ব্যান্ড",
      "definition": "ন্যারো ব্যান্ড (Narrow Band) হলো ডেটা স্থানান্তরের এমন একটি পদ্ধতি যার ব্যান্ডউইথ ক্ষমতা **খুব কম (সাধারণত ৪৫ থেকে ৩০০ bps)**। এই চ্যানেলটি সাধারণত **নিম্ন গতির ডেটা ট্রান্সমিশনের** জন্য ব্যবহৃত হয়। টেলিগ্রাম বা ধীরগতির ডেটা সংকেত (low-speed telegraph signals) আদান-প্রদানের জন্য ন্যারো ব্যান্ড ব্যবহৃত হতো। আধুনিক ব্যবস্থায় এটি তেমন প্রচলিত নয়, তবে স্বল্প ডেটা ও কম দূরত্বের জন্য কখনও কখনও এটি ব্যবহার হতে পারে।"
    },
    {
      "id": 3,
      "name": "ভয়েস ব্যান্ড",
      "definition": "ভয়েস ব্যান্ড (Voice Band) হলো ডেটা স্থানান্তরের এমন একটি পদ্ধতি যার ব্যান্ডউইথ ক্ষমতা **ন্যারো ব্যান্ডের চেয়ে বেশি এবং ব্রড ব্যান্ডের চেয়ে কম (সাধারণত ৯,৬০০ bps পর্যন্ত)**। এটি মূলত মানুষের **কথা বা কণ্ঠস্বর (Voice)** আদান-প্রদানের জন্য ডিজাইন করা হয়েছে। সাধারণ টেলিফোন লাইনের মাধ্যমে ডেটা বা ভয়েস সংকেত আদান-প্রদানের ক্ষেত্রে এই ব্যান্ড ব্যবহৃত হয়। টেলিফোন লাইনের মাধ্যমে কম্পিউটার ডেটা আদান-প্রদানের জন্য মডেমের প্রয়োজন হয়, যা ডেটাকে ভয়েস সংকেতে রূপান্তর করে।"
    },
    {
      "id": 4,
      "name": "ব্রড ব্যান্ড",
      "definition": "ব্রড ব্যান্ড (Broadband) হলো ডেটা স্থানান্তরের এমন একটি উচ্চ-ক্ষমতাসম্পন্ন পদ্ধতি যার ব্যান্ডউইথ ক্ষমতা **খুব বেশি (সাধারণত ১ Mbps বা তার বেশি)** এবং যা একই সাথে একাধিক ফ্রিকোয়েন্সি চ্যানেল ব্যবহার করে ডেটা প্রেরণ করতে পারে। এই উচ্চ গতির কারণে এটি ডেটা, ভয়েস, এবং ভিডিওর মতো বিভিন্ন ধরনের তথ্যকে **একযোগে** দক্ষতার সাথে প্রেরণ করতে পারে। অপটিক্যাল ফাইবার, DSL এবং ক্যাবল ইন্টারনেট সংযোগের মতো আধুনিক উচ্চ গতির ইন্টারনেট সংযোগগুলিতে ব্রড ব্যান্ড প্রযুক্তি ব্যবহৃত হয়।"
    },
    {
      "id": 5,
      "name": "অ্যাসিনক্রোনাস ট্রান্সমিশন",
      "definition": "অ্যাসিনক্রোনাস ট্রান্সমিশন (Asynchronous Transmission) হলো ডেটা স্থানান্তরের এমন একটি পদ্ধতি যেখানে প্রেরক ও প্রাপকের মধ্যে ডেটা আদান-প্রদানের সময় **ক্লক সিগন্যাল (Clock Signal) বা সুনির্দিষ্ট সময়ের সামঞ্জস্য (Synchronization) বজায় রাখা হয় না**। ডেটার প্রতিটি বাইটকে পৃথকভাবে পাঠানো হয় এবং প্রতিটি বাইটের শুরুতে একটি **স্টার্ট বিট (Start Bit)** এবং শেষে একটি **স্টপ বিট (Stop Bit)** যোগ করা হয়, যা প্রাপককে ডেটার শুরু ও শেষ বুঝতে সাহায্য করে। কম গতিতে স্বল্প ডেটা বা ক্যারেক্টারভিত্তিক ডেটা স্থানান্তরের জন্য এটি সুবিধাজনক।"
    },
    {
      "id": 6,
      "name": "সিনক্রোনাস ট্রান্সমিশন",
      "definition": "সিনক্রোনাস ট্রান্সমিশন (Synchronous Transmission) হলো ডেটা স্থানান্তরের এমন একটি উচ্চ-গতির পদ্ধতি যেখানে প্রেরক ও প্রাপকের মধ্যে ডেটা আদান-প্রদানের সময় **ক্লক সিগন্যালের মাধ্যমে সুনির্দিষ্ট সময়ের সামঞ্জস্য (Synchronization) বজায় রাখা হয়**। এই পদ্ধতিতে ডেটার একটি বড় ব্লক বা ফ্রেম একসাথে পাঠানো হয়, যেখানে প্রতিটি ডেটা ব্লকের শুরুতে একটি **হেডার (Header)** এবং শেষে একটি **ট্রেলার (Trailer)** থাকে, কিন্তু কোনো স্টার্ট বা স্টপ বিট থাকে না। উচ্চ গতিতে বৃহৎ আকারের ডেটা স্থানান্তরের জন্য এই পদ্ধতিটি অত্যন্ত কার্যকরী।"
    },
    {
      "id": 7,
      "name": "সিমপ্লেক্স মোড",
      "definition": "সিমপ্লেক্স মোড (Simplex Mode) হলো ডেটা ট্রান্সমিশনের এমন একটি পদ্ধতি যেখানে ডেটা শুধুমাত্র **একমুখী (Uni-directional)** পথে প্রবাহিত হয়। অর্থাৎ, শুধুমাত্র প্রেরক ডেটা প্রেরণ করতে পারে এবং প্রাপক কেবল ডেটা গ্রহণ করতে পারে, কিন্তু এর বিপরীত কাজটি সম্ভব নয়। এটি একটি নন-ইন্টারেক্টিভ ট্রান্সমিশন মোড। **উদাহরণস্বরূপ:** রেডিও বা টেলিভিশন সম্প্রচার, যেখানে স্টেশন ডেটা প্রেরণ করে এবং দর্শক তা গ্রহণ করে।"
    },
    {
      "id": 8,
      "name": "হাফ ডুপ্লেক্স মোড",
      "definition": "হাফ ডুপ্লেক্স মোড (Half Duplex Mode) হলো ডেটা ট্রান্সমিশনের এমন একটি পদ্ধতি যেখানে ডেটা **উভয় দিকেই (Bi-directional)** প্রবাহিত হতে পারে, তবে **একই সময়ে নয়**। একটি পক্ষ যখন ডেটা প্রেরণ করে, তখন অন্য পক্ষকে অবশ্যই অপেক্ষা করতে হয়; ডেটা আদান-প্রদান হয় পর্যায়ক্রমে। এটি আংশিকভাবে ইন্টারেক্টিভ ট্রান্সমিশন মোড। **উদাহরণস্বরূপ:** ওয়াকি-টকি যোগাযোগ ব্যবস্থা, যেখানে একজন কথা বললে অন্যজনকে শুনতে হয় এবং কথা বলা শেষ হলে বার্তা দিতে হয়।"
    },
    {
      "id": 9,
      "name": "ফুল ডুপ্লেক্স মোড",
      "definition": "ফুল ডুপ্লেক্স মোড (Full Duplex Mode) হলো ডেটা ট্রান্সমিশনের সবচেয়ে কার্যকর পদ্ধতি, যেখানে ডেটা **একই সময়ে উভয় দিকেই (Simultaneously Bi-directional)** প্রবাহিত হতে পারে। প্রেরক এবং প্রাপক উভয়েই একই সাথে ডেটা প্রেরণ এবং গ্রহণ করতে পারে, ফলে যোগাযোগের গতি অনেক দ্রুত হয়। এটি ইন্টারেক্টিভ ট্রান্সমিশন মোড। **উদাহরণস্বরূপ:** সাধারণ টেলিফোন বা মোবাইল ফোন কথোপকথন, যেখানে উভয় পক্ষ একই সময়ে কথা বলতে ও শুনতে পারে।"
    },
    {
      "id": 10,
      "name": "ইউনিকাস্ট মোড",
      "definition": "ইউনিকাস্ট মোড (Unicast Mode) হলো ডেটা ট্রান্সমিশনের এমন একটি পদ্ধতি যেখানে ডেটা একটি **একক প্রেরক (One Sender) থেকে একটি একক প্রাপক (One Receiver)**-এর কাছে সরাসরি প্রেরণ করা হয়। এটি পয়েন্ট-টু-পয়েন্ট যোগাযোগ ব্যবস্থা এবং সবচেয়ে সাধারণ প্রকারের ডেটা ট্রান্সফার। ইউনিকাস্ট মোডে ডেটা প্যাকেজটি নেটওয়ার্কে থাকা শুধুমাত্র একটি নির্দিষ্ট গন্তব্যের জন্য তৈরি করা হয়। **উদাহরণস্বরূপ:** একটি ওয়েব সার্ভার থেকে একজন ব্যবহারকারীর ব্রাউজারে ডেটা প্রেরণ।"
    },
    {
      "id": 11,
      "name": "ব্রডকাস্ট মোড",
      "definition": "ব্রডকাস্ট মোড (Broadcast Mode) হলো ডেটা ট্রান্সমিশনের এমন একটি পদ্ধতি যেখানে ডেটা একটি **একক প্রেরক (One Sender) থেকে নেটওয়ার্কে সংযুক্ত সকল প্রাপকের (All Receivers)** কাছে প্রেরণ করা হয়। অর্থাৎ, ডেটা প্যাকেটটি নেটওয়ার্কে উপস্থিত প্রতিটি ডিভাইস গ্রহণ করে। এটি সাধারণত নেটওয়ার্কের বিভিন্ন সার্ভিস বা রুট ইনফরমেশন বিতরণের জন্য ব্যবহৃত হয়। **উদাহরণস্বরূপ:** একটি লোকাল এরিয়া নেটওয়ার্ক (LAN)-এ একটি সার্ভার থেকে সমস্ত ক্লায়েন্ট মেশিনে ডেটা পাঠানো বা রেডিও/টিভি সম্প্রচার।"
    },
    {
      "id": 12,
      "name": "মাল্টিকাস্ট মোড",
      "definition": "মাল্টিকাস্ট মোড (Multicast Mode) হলো ডেটা ট্রান্সমিশনের এমন একটি পদ্ধতি যা **ইউনিকাস্ট ও ব্রডকাস্টের মাঝামাঝি** কাজ করে। এই মোডে ডেটা একটি **একক প্রেরক (One Sender) থেকে নেটওয়ার্কের মধ্যে থাকা নির্দিষ্ট গ্রুপ বা শ্রেণীর প্রাপকদের (Specific Group of Receivers)** কাছে প্রেরণ করা হয়, যারা সেই ডেটা গ্রহণ করার জন্য অনুরোধ করে বা সাবস্ক্রাইব করে। এর ফলে নেটওয়ার্ক ব্যান্ডউইথের অপচয় কম হয়। **উদাহরণস্বরূপ:** ভিডিও কনফারেন্সিং বা অনলাইন গেমিং-এ একটি নির্দিষ্ট গ্রুপকে ডেটা স্ট্রিম করা।"
    },
    {
      "id": 13,
      "name": "অপটিক্যাল ফাইবার ক্যাবল",
      "definition": "অপটিক্যাল ফাইবার ক্যাবল (Optical Fiber Cable) হলো একটি উচ্চ-গতি সম্পন্ন ডেটা ট্রান্সমিশন মাধ্যম, যা **খুব সরু কাঁচ বা প্লাস্টিকের তন্তু** ব্যবহার করে এবং ডেটা সংকেতকে **আলোর ডালস (Light Pulses)** আকারে প্রেরণ করে। এটি তড়িৎচৌম্বকীয় হস্তক্ষেপ (Electromagnetic Interference) থেকে মুক্ত এবং অত্যন্ত দ্রুত গতিতে (Gigabits per second) অনেক দূর পর্যন্ত ডেটা বহন করতে সক্ষম। এটি ব্রডব্যান্ড ইন্টারনেট, টেলিযোগাযোগের মেরুদণ্ড (Backbone) এবং সাবমেরিন ক্যাবল হিসেবে ব্যাপকভাবে ব্যবহৃত হয়।"
    },
    {
      "id": 14,
      "name": "রেডিও ওয়েভ",
      "definition": "রেডিও ওয়েভ (Radio Wave) হলো একটি **বেতার বা ওয়্যারলেস ট্রান্সমিশন মাধ্যম** যা তড়িৎচৌম্বকীয় বর্ণালীর (Electromagnetic Spectrum) একটি অংশ। এটি অ্যান্টেনা ব্যবহার করে ডেটা সংকেতকে **বায়ুমণ্ডলের মাধ্যমে** প্রেরণ করে। এর প্রধান সুবিধা হলো এটি যেকোনো দিকে (Omni-directional) ছড়িয়ে পড়তে পারে এবং এর জন্য কোনো ফিজিক্যাল ক্যাবলের প্রয়োজন হয় না। এটি রেডিও সম্প্রচার, টেলিভিশন, এবং স্বল্প দূরত্বের ওয়্যারলেস যোগাযোগ (যেমন: ওয়াইফাই, ব্লুটুথ) এবং মোবাইল নেটওয়ার্কে ব্যবহৃত হয়।"
    },
    {
      "id": 15,
      "name": "মাইক্রো ওয়েভ",
      "definition": "মাইক্রো ওয়েভ (Microwave) হলো উচ্চ ফ্রিকোয়েন্সির একটি **বেতার বা ওয়্যারলেস ট্রান্সমিশন মাধ্যম** যা ডেটা সংকেতকে **সরল রেখায় (Line-of-Sight)** প্রেরণ করে। এর জন্য প্রেরক ও গ্রাহক অ্যান্টেনা দুটিকে অবশ্যই একে অপরের মুখোমুখি হতে হয়। এটি ডেটা স্থানান্তরের জন্য রেডিও ওয়েভের চেয়ে বেশি ফ্রিকোয়েন্সি ব্যবহার করে। মাইক্রোওয়েভ প্রধানত স্যাটেলাইট যোগাযোগ, মোবাইল ফোন টাওয়ারের মধ্যে সংযোগ এবং দীর্ঘ দূরত্বের ওয়্যারলেস টেলিযোগাযোগে ব্যবহৃত হয়।"
    },
    {
      "id": 16,
      "name": "মডেম",
      "definition": "মডেম (MODEM - Modulator-Demodulator) হলো এমন একটি ডিভাইস যা কম্পিউটার ডেটাকে (ডিজিটাল সংকেত) টেলিফোন লাইনের মতো অ্যানালগ ট্রান্সমিশন মাধ্যমের মধ্য দিয়ে প্রেরণের জন্য **অ্যানালগ সংকেতে রূপান্তর (Modulation)** করে, এবং একইভাবে, প্রাপ্ত অ্যানালগ সংকেতকে আবার কম্পিউটারের ব্যবহারের জন্য **ডিজিটাল সংকেতে রূপান্তর (Demodulation)** করে। এটি ইন্টারনেট অ্যাক্সেস এবং দূরবর্তী যোগাযোগ স্থাপনের জন্য অপরিহার্য।"
    },
    {
      "id": 17,
      "name": "হাব",
      "definition": "হাব (Hub) হলো একটি প্রাথমিক স্তরের নেটওয়ার্ক ডিভাইস যা একটি নেটওয়ার্কের একাধিক ডিভাইসকে **একত্রে সংযুক্ত** করে। এটি একটি **ডাম্ব ডিভাইস (Dumb Device)**, কারণ এটি ইনপুট পোর্টে আসা ডেটা সংকেতকে নেটওয়ার্কে সংযুক্ত **অন্যান্য সকল পোর্টে অন্ধভাবে সম্প্রচার (Broadcast)** করে। এর ফলে ব্যান্ডউইথের অপচয় হয় এবং নেটওয়ার্ক ট্র্যাফিক বৃদ্ধি পায়। বর্তমানে এটিকে মূলত সুইচ দ্বারা প্রতিস্থাপিত করা হয়েছে।"
    },
    {
      "id": 18,
      "name": "সুইচ",
      "definition": "সুইচ (Switch) হলো একটি বুদ্ধিমান (Intelligent) নেটওয়ার্ক ডিভাইস যা একটি লোকাল এরিয়া নেটওয়ার্ক (LAN)-এর একাধিক ডিভাইসকে সংযুক্ত করে। হাবের বিপরীতে, সুইচ ইনপুট পোর্টে আসা ডেটা প্যাকেটকে তার **গন্তব্যের MAC অ্যাড্রেস (Media Access Control Address)** পড়ে শুধুমাত্র **নির্দিষ্ট গন্তব্যের পোর্টে** প্রেরণ করে (ইউনিকাস্ট)। এটি ডেটা সংঘর্ষ (Collision) হ্রাস করে এবং নেটওয়ার্কের সামগ্রিক কার্যকারিতা ও নিরাপত্তা বাড়ায়।"
    },
    {
      "id": 19,
      "name": "রাউটার",
      "definition": "রাউটার (Router) হলো একটি বুদ্ধিমান নেটওয়ার্কিং ডিভাইস যা **বিভিন্ন নেটওয়ার্ককে (যেমন: LAN ও WAN)** সংযুক্ত করে এবং ডেটা প্যাকেটগুলোকে তাদের **IP অ্যাড্রেসের** ভিত্তিতে উৎস থেকে গন্তব্যে প্রেরণের জন্য সবচেয়ে **দক্ষ পথ বা রুট (Route)** নির্ধারণ করে। রাউটার মূলত বিভিন্ন ভিন্ন নেটওয়ার্কের মধ্যে ট্র্যাফিক পরিচালনা করে এবং এটিই ইন্টারনেটকে কার্যকর করার মূল ভিত্তি।"
    },
    {
      "id": 20,
      "name": "গেটওয়ে",
      "definition": "গেটওয়ে (Gateway) হলো এমন একটি নেটওয়ার্ক ডিভাইস যা **ভিন্ন প্রোটোকল বা ভিন্ন আর্কিটেকচার** ব্যবহারকারী দুটি নেটওয়ার্ককে সংযুক্ত করে। এটি একটি নেটওয়ার্ক থেকে অন্য নেটওয়ার্কে ডেটা প্যাকেট পাঠানোর আগে প্রোটোকলগুলো অনুবাদ করে (যেমন: একটি কর্পোরেট নেটওয়ার্ককে ইন্টারনেটের সাথে যুক্ত করা)। গেটওয়ে একটি **অনুবাদক (Translator)** হিসাবে কাজ করে, যার ফলে ভিন্ন নিয়ম ও প্রোটোকল ব্যবহারকারী নেটওয়ার্কগুলো একে অপরের সাথে যোগাযোগ করতে পারে।"
    },
    {
      "id": 21,
      "name": "নেটওয়ার্ক টপোলজি",
      "definition": "নেটওয়ার্ক টপোলজি (Network Topology) হলো একটি নেটওয়ার্কে সংযুক্ত কম্পিউটার বা ডিভাইস এবং তাদের সংযোগকারী ক্যাবলগুলির **ভৌত (Physical) বা যৌক্তিক (Logical) বিন্যাস বা জ্যামিতিক নকশা**। এটি নির্ধারণ করে নেটওয়ার্কের উপাদানগুলো কীভাবে পরস্পরের সাথে সংযুক্ত থাকবে এবং ডেটা কীভাবে প্রবাহিত হবে। প্রধান টপোলজিগুলো হলো: **বাস (Bus), স্টার (Star), রিং (Ring), ট্রি (Tree)** এবং **মেশ (Mesh) টপোলজি**।"
    },
    {
      "id": 22,
      "name": "ক্লাউড কম্পিউটিং",
      "definition": "ক্লাউড কম্পিউটিং (Cloud Computing) হলো ইন্টারনেট (বা 'ক্লাউড') এর মাধ্যমে কম্পিউটার রিসোর্স যেমন: **সার্ভার, স্টোরেজ, ডাটাবেজ, সফটওয়্যার, এবং নেটওয়ার্কিং সার্ভিসেস** ব্যবহারকারীদের কাছে চাহিদা অনুযায়ী পরিষেবা হিসেবে সরবরাহ করার একটি মডেল। ব্যবহারকারীকে এই রিসোর্সগুলোর মালিকানা বা সরাসরি পরিচালনার দায়িত্ব নিতে হয় না, কেবল ব্যবহারের জন্য অর্থ প্রদান করতে হয়। এর প্রধান সুবিধাগুলো হলো: **কম খরচ, সহজে স্কেলিং (Scaling), এবং রিমোট অ্যাক্সেস** (যেমন: Amazon AWS, Google Cloud, Microsoft Azure)।"
    }
  ]
}
