{
  "topics": [
    {
      "id": 1,
      "name": "ডেটা ও  তথ্য",
      "definition": "ডেটা ও  তথ্য: সুনির্দিষ্ট আউটপুট বা ফলাফল পাওয়ার জন্য প্রসেসিংয়ে ব্যবহৃত কাঁচামাল সমূহকে ডেটা বা উপাত্ত বলে।\n ডেটাকে নির্দিষ্ট গঠনের সাজিয়ে তারপর প্রক্রিয়াকরণ করে যে কার্যকর ও অর্থপূর্ণ ফলাফল পাওয়া যায় তাকে তথ্য বা ইনফরমেশন বলে।\n উদাহরণ-টাঙ্গাইল থেকে ঢাকা ১০০ কিঃমিটার দূরে অবস্থিত।\nএখানে প্রত্যেকটি (সাতটি) শব্দই ডেটা বা উপাত্ত অন্যদিকে  সম্পূর্ণ বাক্যটি একটি তথ্যর উদাহরণ।"
    },
    {
      "id": 3,
      "name": "আইওটি-IoT-Internet of Things",
      "definition": "আইওটি:বিভিন্ন জিনিসপত্রের সাথে ইন্টারনেটের সংযোগকে Internet of Things (IoT) বলা হয়। \nএই জিনিসের মধ্যে রয়েছে ফোন , সেচ ব্যবস্থা, নিরাপত্তা ক্যামেরা।"
    },
    {
      "id": 4,
      "name": "বিশ্বগ্রাম",
      "definition": "বিশ্বগ্রাম বা গ্লোবাল ভিলেজ হচ্ছে এমন একটি পরিবেশ যেখানে পৃথিবীর সকল মানুষই একটি একক সমাজে বসবাস করে এবং ইলেকট্রনিক মিডিয়া ও তথ্য প্রযুক্তি ব্যবহারের মাধ্যমে একে অপরকে সেবা প্রদান করে থাকে "
    },
    {
      "id": 5,
      "name": "টেলিকনফারেন্সিং",
      "definition": "টেলিকনফারেন্সিং: টেলিযোগাযোগ বা টেলিফোনের মাধ্যমে সভা সমাবেশ করাকে টেলিকনফারেন্সিং বলা হয়।"
    },
    {
      "id": 6,
      "name": "ভিডিও কনফারেন্সিং",
      "definition": "ভিডিও কনফারেন্সিং: টেলিকমিউনিকেশন প্রযুক্তি ব্যবহার করে দুই বা ততোধিক ভৌগোলিক স্থানে অডিও-ভিডিও একসাথে বহুমুখী স্থানান্তর করার প্রক্রিয়াকে ভিডিও কনফারেন্সিং বলে।"
    },
    {
      "id": 7,
      "name": "আউটসোর্সিং ও ফ্রিল্যান্সিং",
      "definition": "আউটসোর্সিং হচ্ছে কাজ দেওয়া অর্থাৎ কোন ব্যবসায়িক অনুশীলনীর মাধ্যমে কোন তৃতীয় পক্ষকে বিভিন্ন সেবা বা কাজ প্রদান করা হলো আউটসোর্সিং\n অন্যদিকে ফ্রিল্যান্সিং হচ্ছে মুক্ত পেশা, কোন একক প্রতিষ্ঠানের দায়বদ্ধ না থেকে বিভিন্ন প্রতিষ্ঠানে নিজের দক্ষতা অনুযায়ী খণ্ডকালীন কাজ করাই হলো ফ্রিল্যান্সিং\nসৃজনশীলের  ধারণাঃ রহিম ১টি নির্দিষ্ট কোম্পানি কাজ অনলাইন বিভিন্ন মাধ্যমে প্রদান করেন এবং অবসর সময়ে অন্য একটি প্রতিষ্ঠানের কিছু কাজ করে বৈদেশিক মুদ্রা অর্জন করেন যা তথ্য ও যোগাযোগ প্রযুক্তির আউটসোর্সিং ও ফ্রিল্যান্সিং উদাহরণ।"
    },
    {
      "id": 9,
      "name": "টেলিমেডিসিন",
      "definition": "টেলিমেডিসিন:মোবাইল ফোন বা ভিডিও কনফারেন্সিংর মাধ্যমে চিকিৎসা সেবা প্রদানের প্রক্রিয়াকে টেলিমেডিসিন বলা হয়।"
    },
    {
      "id": 10,
      "name": "ই-লার্নিং-Elctronic Learning",
      "definition": "ই-লার্নিং: গতানুগতিক শ্রেণিকক্ষে শিক্ষাদানের পরিবর্তিতে অনলাইনে শিক্ষক শিক্ষার্থীর মধ্যে ইলেকট্রনিক মাধ্যম বিশেষত কম্পিউটার, ইন্টারনেট ও ওয়েব ব্যবহার করে শিক্ষা কার্যক্রম পরিচালনা করার পদ্ধতি হলো ই লার্নিং"
    },
    {
      "id": 11,
      "name": "ভার্চুয়াল রিয়েলিটি-VR",
      "definition": "ভার্চুয়াল রিয়েলিটি: বাস্তব নয় কিন্তু বাস্তবের চেতনা উদ্রেককারী বিজ্ঞান নির্ভর কল্পনা জগতকে ভার্চুয়াল রিয়েলিটি বা কল্পবাস্তবতা বলে। ভার্চুয়াল রিয়েলিটির প্রয়োজনীয় উপাদান- হেড মাউন্টেড ডিসপ্লে বা ইফেক্টর, রিয়েলিটি সিমুলেশন, এপ্লিকেশন ও জিওমেট্রি। সৃজনশীল ধারণা হিসেবে: যেকোনো জায়গা থেকে চাঁদে যাওয়ার প্রযুক্তি হলো ভার্চুয়াল রিয়েলিটি। সিমুলেশন করে কোন কিছু দেখা বা গবেষণা এবং ত্রিমাত্রিক মডেল তৈরী করার প্রযুক্তি হলো ভার্চুয়াল রিয়েলিটি। ঘরে বসে গাড়ি চালানোর প্রশিক্ষণ নেওয়ার প্রযুক্তিটি হলো ভার্চুয়াল রিয়েলিটি। ডাক্তার সাহেবের অস্ত্রোপচার বা শল্য চিকিৎসার প্রশিক্ষণ নেওয়ার প্রযুক্তিটি হলো ভার্চুয়াল রিয়েলিটি।\nটেলিপ্রেজেন্স ভার্চুয়াল রিয়েলিটির একটি প্রয়োগ বলা যায়, উচ্চ ক্ষমতা সম্পন্ন কম্পিউটার গ্রাফিক্স ব্যবহারের মাধ্যমে অনেক দূর থেকে কাজ পরিচালনা করার প্রক্রিয়া ।"
    },
    {
      "id": 12,
      "name": "কৃত্তিম বুদ্ধিমত্তা-Artificial Intelligence",
      "definition": "কৃত্তিম বুদ্ধিমত্তা: মানুষের চিন্তাভাবনাকে মেশিনে উপস্থাপন করাই কৃত্রিম বুদ্ধিমত্তা।\nPROLOG, LISP, Python, MATLAB হল কৃত্তিম বুদ্ধিমত্তার জন্য প্রোগ্রামিং ভাষা।\nসৃজনশীলের ধারণাঃ বর্তমানে ব্যবহৃত ড্রাইভার বিহীন গাড়ি চালানোর প্রযুক্তিটি হলো, কৃত্রিম বুদ্ধিমত্তা, বা কৃত্রিম বুদ্ধিমত্তা সম্পন্ন রোবট। এক্সপার্ট সিস্টেমে ব্যবহৃত প্রযুক্তিটি হলো কৃত্রিম বুদ্ধিমত্তা।"
    },
    {
      "id": 13,
      "name": "নিউরাল নেটওয়ার্ক",
      "definition": "নিউরাল নেটওয়ার্ক: নিউরাল নেটওয়ার্ক মেশিন লার্নিং এবং কৃত্রিম বুদ্ধিমত্তা (AI) এর একটি শক্তিশালী মডেল যা মানুষের মস্তিষ্কের নিউরনগুলোর মতো কাজ করে। এটি ইনপুট, হিডেন লেয়ার এবং আউটপুট লেয়ার নিয়ে গঠিত। \nপ্রতিটি লেয়ার নিউরনের মাধ্যমে তথ্য প্রক্রিয়া করে এবং পরবর্তী স্তরে প্রেরণ করে।"
    },
    {
      "id": 14,
      "name": "রোবটিক্স",
      "definition": "রোবটিক্স: বিজ্ঞানের যে শাখায় রোবটের নকশা ডিজাইন ও কাঠামো নিয়ে আলোচনা করা হয় তাকে রোবটিক্স বলে। রোবটের হাতকে অ্যাকচুয়েটর বলে  এবং রোবট ৩৬০ ডিগ্রি কোণে ঘুরতে পারে।\nসৃজনশীলের উদাহরণঃ\n* ঝুঁকিপূর্ণ বা শিল্প কারখানায় অধিক তাপমাত্রায় কাজ করার ক্ষেত্রে রোবট ব্যবহার করা হয়। গাড়ি নির্মাণ ও জটিল অপারেশন বা শল্য চিকিৎসা করতে রোবট ব্যবহার করা হয। \n* বিভিন্ন প্রতিষ্ঠানে তাদের নিরাপত্তা, গবেষণা, এমনকি বিনোদনের ক্ষেত্রে মানুষের ব্যবহার  সীমিত করে নিয়ে আসছে রোবট । প্রযুক্তির এই জগতকে চতুর্থ শিল্প বিপ্লব(4IR-4th Industrial Revolution) নামে পরিচিত।  4IR এর প্রধান হাতিয়ার হিসেবে রোবট ব্যবহার করা হচ্ছে ।"
    },
    {
      "id": 15,
      "name": "জেনেটিক ইঞ্জিনিয়ারিং",
      "definition": "জেনেটিক ইঞ্জিনিয়ারিং: কোন জীব থেকে একটি নির্দিষ্ট জিন বহনকারী ডিএনএ পৃথক করে ভিন্ন একটি জিবে স্থানান্তরের কৌশলকে জেনেটিক ইঞ্জিনিয়ারিং বলে।\nসৃজনশীলের ধারণাঃ *নতুন জীব কোষ সৃষ্টি যেমন নতুন জাতের তেলাপিয়া মাছ, মুরগি, গরু ইত্যাদি উৎপাদনের প্রযুক্তিটি হল জেনেটিক ইঞ্জিনিয়ারিং।\n*\tহাইব্রিড শস্য বা বীজ(কৃষি সম্পর্কীয়) যেমন মিষ্টি টমেটো, মিষ্টি গাজর ইত্যাদি উৎপাদনের প্রযুক্তিটি হল জেনেটিক ইঞ্জিনিয়ারিং। দুধে আমিষের পরিমাণ বাড়ানো প্রযুক্তিটি হল জেনেটিক ইঞ্জিনিয়ারিং।\n*\tবিভিন্ন ধরনের ঔষধ,ভ্যাকসিন, হরমোন ইন্টারফেরন, এন্টিজেন, এন্টিবডি প্রভৃতি উৎপাদন করার প্রযুক্তিটি হলো জেনেটিক ইঞ্জিনিয়ারিং।"
    },
    {
      "id": 16,
      "name": "ক্রায়োসার্জারি",
      "definition": "ক্রায়োসার্জারি: অত্যাধিক শীতল তাপমাত্রায় বিভিন্ন গ্যাস প্রয়োগ করে ত্বকের অস্বাভাবিক ও রোগাক্রান্ত টিস্যু ধ্বংস করার প্রক্রিয়াকে ক্রয়োসার্জারি বলে।\n ক্রায়োসার্জারিতে ব্যবহৃত কিছু গ্যাসের নাম ডাই মিথাইল ইথার ও প্রোপেন, তরল কার্বন ডাই অক্সাইড, তরল নাইট্রাস অক্সাইড, তরল অক্সিজেন,  হিলিয়াম নাইট্রোজেন আর্গন।"
    },
    {
      "id": 17,
      "name": "বায়োমেট্রিক্স",
      "definition": "বায়োমেট্রিক্স: যে কৌশলের মাধ্যমে মানুষের শারীরিক কাঠামো, আচার-আচরণ, বৈশিষ্ট্য, গুনাগুন, ব্যক্তিত্ব প্রভৃতি দ্বারা নির্দিষ্ট ব্যক্তিকে চিহ্নিত বা সনাক্ত করা যায় তাকে বায়োমেট্রিক্স বলে।\nদেহের গঠন ও আচরণগত বৈশিষ্ট্যের উপর ভিত্তি করে বায়োমেট্রিক দুই প্রকার \n১. শারীরবৃত্তীয় ( মুখ শনাক্তকরণ,  আঙুলের ছাপ,  হাতের ছাপ,  চোখের মনি ও রেটিনা স্ক্যান,  ডি এন এ )\n২. আচরণগত (স্বাক্ষর, কণ্ঠ সনাক্তকরণ, কী স্ট্রোক [কিবোর্ডের লেখালেখির গতিকে কি স্ট্রোক বলে ])\nসৃজনশীলের ধারণাঃ\n*\tআব্দুর রহিম ফিঙ্গারপ্রিন্ট ব্যবহার করে তার বাসায় প্রবেশ করলেন তারপর ল্যাবের সামনে চোখের রেটিনা স্ক্যান করে ল্যাবরুমে প্রবেশ করেন,  এখানে প্রযুক্তিটি হল বায়োমেট্রিক্স  যেখানে প্রথম বায়োমেট্রিক্স অর্থাৎ আঙুলের ছাপ খরচ কম অপরদিকে চোখে রেটিনা স্ক্যান খরচ বেশি । \n*\tবেওয়ারিশ (অপরিচিত ) মৃতদেহ সনাক্তকরণে বায়োমেট্রিক্সের শারীরবৃত্তীয় ডিএনএ পরীক্ষা করা হয় ।"
    },
    {
      "id": 18,
      "name": "বায়োইনফরমেটিকস",
      "definition": "বায়োইনফরমেটিকস: বা জৈব তথ্য বিজ্ঞান হল এমন এক প্রযুক্তি যা ফলিত গণিত, তথ্যবিজ্ঞান, পরিসংখ্যান, কম্পিউটার বিজ্ঞান, কৃত্রিম বুদ্ধিমত্তা এবং জৈব রসায়ন ব্যবহার করে জীববিজ্ঞানের সমস্যা সমূহ সমাধান করে । বায়ো ইনফরমেটিকস  বায়োলজিক্যাল ডাটা নিয়ে কাজ করে ।"
    },
    {
      "id": 19,
      "name": "ন্যানোটেকনোলজি",
      "definition": "ন্যানোটেকনোলজি: ১-১০০ ন্যানোমিটার আকারে বস্তু তৈরি ও ব্যবহার করাকে ন্যানোটেকনোলজি বলে।\nএই আকৃতির কোনও কিছু তৈরি করাকে ন্যানোপার্টিকেল বলে। বর্তমান প্রজন্মের মোবাইল ফোনের ন্যানো-সিম ন্যানোপ্রযুক্তি বা ন্যানো টেকনোলজির উদাহরণ।\nন্যানোটেকনোলজিঃ 10-9 মিটারকে ন্যানোমিটার বলে এবং বিজ্ঞান ও প্রযুক্তি ব্যবহার ১ থেকে ১০০ ন্যানোমিটার আকৃতির কোনও কিছু তৈরি করা এবং ব্যবহার করাকে ন্যানোটেকনোলজি বলে। এই আকৃতির কোনও কিছু তৈরি করাকে ন্যানোপার্টিকেল বলে। বর্তমান প্রজন্মের মোবাইল ফোনের ন্যানো-সিম ন্যানোপ্রযুক্তি বা ন্যানো টেকনোলজির উদাহরণ । ন্যানোপ্রযুক্তি দুই ধরনেরঃ (ক) ক্ষুদ্র থেকে বৃহৎ (Bottom to Up):  (খ) বৃহৎ থেকে ক্ষুদ্র (Top to Down),\nসৃজনশীলের এর ধারণাঃ আণবিক গবেষণা পর্যায়ে (অণু,পরমাণু), খাদ্যশিল্পে (খাদ্যের প্যাকেজিং, গুনাগুন ও স্বাদ বৃদ্ধিতে) , খেলাধুলার সামগ্রী( ক্রিকেট বল ও টেনিস বললের স্থায়িত্ত বৃদ্ধিতে) প্রযুক্তিটি ন্যানোটেকনোলজি । "
    },
    {
      "id": 20,
      "name": "মহাকাশ অভিযান",
      "definition": "মহাকাশ অভিযান: মহাকাশযান পৃথিবীর মাধ্যাকর্ষণ শক্তি কাটিয়ে অন্তত ১০০ কিমি উপরে গেলে সেটি মহাকাশ অভিযান।"
    },
    {
      "id": 21,
      "name": "হ্যাকিং",
      "definition": "হ্যাকিং: কোনও কম্পিউটার সিস্টেম বা ডেটায় অননুমোদিতভাবে প্রবেশ করাকে হ্যাকিং বলে।\nএই ধরনের অপকর্মের সাথে যারা জডিত তাদেরকে হ্যাকার বলে।"
    },
    {
      "id": 22,
      "name": "ফিশিং",
      "definition": "ফিশিং হল একটি সাইবার অপরাধ যেখানে একটি অবৈধ (ক্ষতিকর, জালিয়াত) চক্র, প্রতিষ্ঠান কিংবা মানুষ ইমেইল, টেলিফোন বা বার্তার মাধ্যমে  নিজেকে  পরিচিত হিসেবে জাহির করে এবং ব্যক্তিগত তথ্য, ব্যাঙ্কিং এবং ক্রেডিট কার্ডের বিশদ বিবরণ এবং পাসওয়ার্ডের মতো সংবেদনশীল তথ্য প্রদানের জন্য কাউকে প্রলুব্ধ করাকে ফিশিং বলে।"
    },
    {
      "id": 23,
      "name": "স্প্যামিং",
      "definition": "স্প্যামিং: অনাকাঙ্ক্ষিত ইমেইল বা মেসেজ পাঠানোকে স্প্যামিং বলে।"
    },
    {
      "id": 24,
      "name": "সফটওয়্যার পাইরেসি",
      "definition": "সফটওয়্যার পাইরেসি: সফটওয়্যার প্রস্তুতকারীর অনুমতি ছাড়া কপি, বিতরণ বা পরিবর্তন করাকে সফটওয়্যার পাইরেসি বলে।"
    },
    {
      "id": 25,
      "name": "প্লেজারিজম",
      "definition": "প্লেজারিজম : অন্যের সাহিত্য, গবেষণা, আইডিয়া নিজের নামে প্রকাশ করাকে প্লেজারিজম বলে।\nঅন্যের লেখা চুরি অথবা নিজের নামে প্রকাশ করাকে প্লেজারিজম বলে। Grammarly, Plagium, plagiarismchecker এই সফটওয়ারে দিয়ে প্লেজারিজম চেক করা জায়।"
    }
  ]
}
